### Slightly modified from https://github.com/adeshpande3/Pandas-Tutorial

In [1]:
!pip install pandas

Collecting pandas
  Downloading https://files.pythonhosted.org/packages/5d/24/91ad2da4a1da2747595d2f47f858a131036f598fb495ec6346d08d8b8df6/pandas-1.0.5-cp37-cp37m-macosx_10_9_x86_64.whl (10.0MB)
    100% |████████████████████████████████| 10.0MB 2.0MB/s eta 0:00:01
Collecting pytz>=2017.2 (from pandas)
  Using cached https://files.pythonhosted.org/packages/4f/a4/879454d49688e2fad93e59d7d4efda580b783c745fd2ec2a3adf87b0808d/pytz-2020.1-py2.py3-none-any.whl
Requirement already satisfied: numpy>=1.13.3 in /Users/roman/.pyenv/versions/3.7.3/envs/iasa_kpi_ml_course/lib/python3.7/site-packages (from pandas) (1.19.1)
Requirement already satisfied: python-dateutil>=2.6.1 in /Users/roman/.pyenv/versions/3.7.3/envs/iasa_kpi_ml_course/lib/python3.7/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /Users/roman/.pyenv/versions/3.7.3/envs/iasa_kpi_ml_course/lib/python3.7/site-packages (from python-dateutil>=2.6.1->pandas) (1.15.0)
Installing collected packages: pytz, pandas
Successfully installed pandas-1.0.5 pytz-2020.1
You are using pip version 19.0.3, however version 20.2b1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

In [3]:
!ls

1.0-basic-python.ipynb    3.0-pandas-tutorial.ipynb
2.0-numpy-tutorial.ipynb  data.csv

In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.0.5'

In [4]:
made_up_df = pd.DataFrame({"a": [2, 3, 4, 5], "b": [6, 7, 8, 9]})
made_up_df

   a  b
0  2  6
1  3  7
2  4  8
3  5  9

In [3]:
data_df = pd.read_csv('data.csv')

In [5]:
type(data_df)

pandas.core.frame.DataFrame

In [6]:
data_df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328    64.0    N    0.0
1    1985      25   1106      77   1354    70.0    H    0.0
2    1985      25   1112      63   1223    56.0    H    0.0
3    1985      25   1165      70   1432    54.0    H    0.0
4    1985      25   1192      86   1447    74.0    H    0.0

In [7]:
data_df.head(10)

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328    64.0    N    0.0
1    1985      25   1106      77   1354    70.0    H    0.0
2    1985      25   1112      63   1223    56.0    H    0.0
3    1985      25   1165      70   1432    54.0    H    0.0
4    1985      25   1192      86   1447    74.0    H    0.0
5    1985      25   1218      79   1337    78.0    H    0.0
6    1985      25   1228      64   1226    44.0    N    0.0
7    1985      25   1242      58   1268    56.0    N    0.0
8    1985      25   1260      98   1133    80.0    H    0.0
9    1985      25   1305      97   1424    89.0    H    0.0

In [8]:
data_df.tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
43844    1996      16   1276      73   1177    65.0    H    0.0
43845    1996      16   1328      99   1238    68.0    H    0.0
43846    1996      16   1451     102   1201    86.0    A    0.0
43847    1996      17   1207     106   1159    57.0    H    0.0
43848    1996      17   1396      65      1     NaN  NaN    NaN

In [9]:
data_df.shape

(43849, 8)

In [10]:
data_df.dtypes

Season      int64
Daynum      int64
Wteam       int64
Wscore      int64
Lteam       int64
Lscore    float64
Wloc       object
Numot     float64
dtype: object

In [11]:
data_df.values

array([[1985, 20, 1228, ..., 64.0, 'N', 0.0],
       [1985, 25, 1106, ..., 70.0, 'H', 0.0],
       [1985, 25, 1112, ..., 56.0, 'H', 0.0],
       ...,
       [1996, 16, 1451, ..., 86.0, 'A', 0.0],
       [1996, 17, 1207, ..., 57.0, 'H', 0.0],
       [1996, 17, 1396, ..., nan, nan, nan]], dtype=object)

In [12]:
type(data_df.values)

numpy.ndarray

In [13]:
data_df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [14]:
data_df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,43849.000000,43849.000000,43849.000000,43849.000000,43849.000000,43848.000000,43848.000000
mean,1990.079523,79.980182,1286.238706,79.469931,1283.736368,67.396301,0.005747
std,3.140312,30.126598,104.128888,13.436211,105.856948,11.841351,0.088903
min,1985.000000,11.000000,1102.000000,35.000000,1.000000,25.000000,0.000000
25%,1987.000000,56.000000,1199.000000,70.000000,1190.000000,59.000000,0.000000
50%,1990.000000,82.000000,1283.000000,79.000000,1280.000000,67.000000,0.000000
75%,1993.000000,105.000000,1380.000000,88.000000,1378.000000,75.000000,0.000000
max,1996.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,3.000000

In [15]:
data_df.max()

Season    1996.0
Daynum     132.0
Wteam     1464.0
Wscore     186.0
Lteam     1464.0
Lscore     150.0
Numot        3.0
dtype: float64

In [17]:
data_df['Wscore'].head()

0    81
1    77
2    63
3    70
4    86
Name: Wscore, dtype: int64

In [18]:
data_df['Wscore'].max()

186

In [21]:
data_df['Lscore'].mean()

67.39630085750775

In [22]:
data_df['Wscore'].argmax()

24970

In [23]:
data_df['Season'].value_counts()

1992    4127
1991    4123
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
1996       8
Name: Season, dtype: int64

In [24]:
type(data_df['Season'].value_counts())

pandas.core.series.Series

In [25]:
data_df.Season.value_counts()

1992    4127
1991    4123
1995    4077
1994    4060
1990    4045
1989    4037
1993    3982
1988    3955
1987    3915
1986    3783
1985    3737
1996       8
Name: Season, dtype: int64

In [26]:
data_df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328    64.0    N    0.0
1    1985      25   1106      77   1354    70.0    H    0.0
2    1985      25   1112      63   1223    56.0    H    0.0
3    1985      25   1165      70   1432    54.0    H    0.0
4    1985      25   1192      86   1447    74.0    H    0.0

In [28]:
data_df.index

RangeIndex(start=0, stop=43849, step=1)

In [29]:
# By index
data_df.iloc[1]

Season    1985
Daynum      25
Wteam     1106
Wscore      77
Lteam     1354
Lscore      70
Wloc         H
Numot        0
Name: 1, dtype: object

In [30]:
data_df.iloc[1, 2]

1106

In [31]:
data_df.iloc[data_df['Wscore'].argmax()]

Season    1991
Daynum      68
Wteam     1258
Wscore     186
Lteam     1109
Lscore     140
Wloc         H
Numot        0
Name: 24970, dtype: object

In [32]:
data_df.iloc[data_df['Wscore'].argmax()]["Wloc"]

'H'

In [33]:
# Smart loc
data_df.loc[1, "Season"]

1985

In [34]:
data_df.loc[data_df['Wscore'].argmax(), 'Wloc']

'H'

In [35]:
data_df["Season"].head()

0    1985
1    1985
2    1985
3    1985
4    1985
Name: Season, dtype: int64

In [36]:
data_df[["Season", "Wscore"]].head()

   Season  Wscore
0    1985      81
1    1985      77
2    1985      63
3    1985      70
4    1985      86

In [37]:
data_df.iloc[:3]

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328    64.0    N    0.0
1    1985      25   1106      77   1354    70.0    H    0.0
2    1985      25   1112      63   1223    56.0    H    0.0

In [38]:
data_df.sort_values('Lscore').head()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
31366    1992     119   1453      69   1434    25.0    H    0.0
9481     1987      84   1420      45   1288    25.0    H    0.0
215      1985      33   1266      74   1109    27.0    H    0.0
31959    1993      33   1344      56   1306    27.0    H    0.0
25219    1991      74   1343      55   1463    27.0    H    0.0

In [39]:
data_df[data_df['Wscore'] > 150]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
5269     1986      75   1258     151   1109   107.0    H    0.0
12046    1988      40   1328     152   1147    84.0    H    0.0
12355    1988      52   1328     151   1173    99.0    N    0.0
16040    1989      40   1328     152   1331   122.0    H    0.0
16853    1989      68   1258     162   1109   144.0    A    0.0
17867    1989      92   1258     181   1109   150.0    H    0.0
19653    1990      30   1328     173   1109   101.0    H    0.0
19971    1990      38   1258     152   1109   137.0    A    0.0
20022    1990      40   1116     166   1109   101.0    H    0.0
22145    1990      97   1258     157   1362   115.0    H    0.0
23582    1991      26   1318     152   1258   123.0    N    0.0
24341    1991      47   1328     172   1258   112.0    H    0.0
24970    1991      68   1258     186   1109   140.0    H    0.0
25656    1991      84   1106     151   1212    97.0    H    0.0
28687    1992      54   1261     159   1319    86.0    H    0.0
35023    1993     112   1380     155   1341    91.0    A    0.0
40060    1995      32   1375     156   1341   114.0    H    0.0

In [40]:
data_df['Wscore'] > 150

0        False
1        False
2        False
3        False
4        False
         ...
43844    False
43845    False
43846    False
43847    False
43848    False
Name: Wscore, Length: 43849, dtype: bool

In [41]:
data_df[(data_df['Wscore'] > 150) & (data_df['Lscore'] < 100)]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
12046    1988      40   1328     152   1147    84.0    H    0.0
12355    1988      52   1328     151   1173    99.0    N    0.0
25656    1991      84   1106     151   1212    97.0    H    0.0
28687    1992      54   1261     159   1319    86.0    H    0.0
35023    1993     112   1380     155   1341    91.0    A    0.0

In [43]:
data_df.groupby('Wteam')['Wscore'].mean().head()

Wteam
1102    73.536232
1103    76.904762
1104    77.625000
1106    88.760331
1108    85.296703
Name: Wscore, dtype: float64

In [44]:
data_df.groupby('Wteam')['Wloc'].value_counts().head(9)

Wteam  Wloc
1102   H        41
       A        20
       N         8
1103   H       105
       A        40
       N         2
1104   H       131
       A        54
       N        47
Name: Wloc, dtype: int64

In [45]:
# Avoid if you can
for index, row in data_df.iterrows():
    print(row)
    if index == 1:
        break

Season    1985
Daynum      20
Wteam     1228
Wscore      81
Lteam     1328
Lscore      64
Wloc         N
Numot        0
Name: 0, dtype: object
Season    1985
Daynum      25
Wteam     1106
Wscore      77
Lteam     1354
Lscore      70
Wloc         H
Numot        0
Name: 1, dtype: object

In [46]:
for row in data_df.itertuples():
    print(row)
    if index == 1:
        break

Pandas(Index=0, Season=1985, Daynum=20, Wteam=1228, Wscore=81, Lteam=1328, Lscore=64.0, Wloc='N', Numot=0.0)

In [47]:
data_df.isnull()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore   Wloc  Numot
0       False   False  False   False  False   False  False  False
1       False   False  False   False  False   False  False  False
2       False   False  False   False  False   False  False  False
3       False   False  False   False  False   False  False  False
4       False   False  False   False  False   False  False  False
...       ...     ...    ...     ...    ...     ...    ...    ...
43844   False   False  False   False  False   False  False  False
43845   False   False  False   False  False   False  False  False
43846   False   False  False   False  False   False  False  False
43847   False   False  False   False  False   False  False  False
43848   False   False  False   False  False    True   True   True

[43849 rows x 8 columns]

In [48]:
data_df.isnull().sum()

Season    0
Daynum    0
Wteam     0
Wscore    0
Lteam     0
Lscore    1
Wloc      1
Numot     1
dtype: int64

In [49]:
data_df.tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
43844    1996      16   1276      73   1177    65.0    H    0.0
43845    1996      16   1328      99   1238    68.0    H    0.0
43846    1996      16   1451     102   1201    86.0    A    0.0
43847    1996      17   1207     106   1159    57.0    H    0.0
43848    1996      17   1396      65      1     NaN  NaN    NaN

In [50]:
data_df["Lscore_plus_10"] = data_df["Lscore"] + 10
data_df

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Wloc,Numot,Lscore_plus_10
0,1985,20,1228,81,1328,64.0,N,0.0,74.0
1,1985,25,1106,77,1354,70.0,H,0.0,80.0
2,1985,25,1112,63,1223,56.0,H,0.0,66.0
3,1985,25,1165,70,1432,54.0,H,0.0,64.0
4,1985,25,1192,86,1447,74.0,H,0.0,84.0
...,...,...,...,...,...,...,...,...,...
43844,1996,16,1276,73,1177,65.0,H,0.0,75.0
43845,1996,16,1328,99,1238,68.0,H,0.0,78.0
43846,1996,16,1451,102,1201,86.0,A,0.0,96.0
43847,1996,17,1207,106,1159,57.0,H,0.0,67.0
43848,1996,17,1396,65,1,NaN,NaN,NaN,NaN

In [51]:
def lower(x):
    return x.lower() if not pd.isnull(x) else None

lower(data_df["Wloc"])

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [52]:
data_df["Wloc"].apply(lower)

0           n
1           h
2           h
3           h
4           h
         ...
43844       h
43845       h
43846       a
43847       h
43848    None
Name: Wloc, Length: 43849, dtype: object

In [53]:
data_df["Wloc"].str.lower()

0          n
1          h
2          h
3          h
4          h
        ...
43844      h
43845      h
43846      a
43847      h
43848    NaN
Name: Wloc, Length: 43849, dtype: object

In [54]:
data_df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot  Lscore_plus_10
0    1985      20   1228      81   1328    64.0    N    0.0            74.0
1    1985      25   1106      77   1354    70.0    H    0.0            80.0
2    1985      25   1112      63   1223    56.0    H    0.0            66.0
3    1985      25   1165      70   1432    54.0    H    0.0            64.0
4    1985      25   1192      86   1447    74.0    H    0.0            84.0

In [55]:
data_df.to_csv("result.csv")

In [56]:
!ls

1.0-basic-python.ipynb
2.0-numpy-tutorial.ipynb
3.0-pandas-tutorial.ipynb
4.0-exploratory-data-analysis.ipynb
5.0-titanic-data-science-solutions.ipynb
data.csv
result.csv

In [57]:
!head result.csv

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Wloc,Numot,Lscore_plus_10
0,1985,20,1228,81,1328,64.0,N,0.0,74.0
1,1985,25,1106,77,1354,70.0,H,0.0,80.0
2,1985,25,1112,63,1223,56.0,H,0.0,66.0
3,1985,25,1165,70,1432,54.0,H,0.0,64.0
4,1985,25,1192,86,1447,74.0,H,0.0,84.0
5,1985,25,1218,79,1337,78.0,H,0.0,88.0
6,1985,25,1228,64,1226,44.0,N,0.0,54.0
7,1985,25,1242,58,1268,56.0,N,0.0,66.0
8,1985,25,1260,98,1133,80.0,H,0.0,90.0

In [58]:
reloaded_df = pd.read_csv('result.csv')
reloaded_df.head()

,Unnamed: 0,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Wloc,Numot,Lscore_plus_10
0,0,1985,20,1228,81,1328,64.0,N,0.0,74.0
1,1,1985,25,1106,77,1354,70.0,H,0.0,80.0
2,2,1985,25,1112,63,1223,56.0,H,0.0,66.0
3,3,1985,25,1165,70,1432,54.0,H,0.0,64.0
4,4,1985,25,1192,86,1447,74.0,H,0.0,84.0